package com.qkwl.common.i18n;

import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;

import com.qkwl.common.Enum.validate.LocaleEnum;
import com.qkwl.common.dto.user.City;
import com.qkwl.common.model.KeyValues;
import org.apache.http.util.TextUtils;
import org.springframework.util.StringUtils;
import org.springframework.web.servlet.LocaleResolver;
import org.springframework.web.servlet.support.RequestContext;
import org.springframework.web.servlet.support.RequestContextUtils;

import net.sf.json.JSONArray;
import net.sf.json.JSONObject;

import java.util.ArrayList;
import java.util.List;

/**
 * 语言 
 * @author LY
 */
public class LuangeHelper{

	public static final String AREA_CODE_EN = "\"Bhutan\":\"975\",\"EastSamoa\":\"684\",\"China\":\"86\",\"MidwayIsland\":\"1808\",\"CentralAfrica\":\"236\",\"Denmark\":\"45\",\"Uganda\":\"256\",\"Uruguay\":\"598\",\"Chad\":\"235\",\"Israel\":\"972\",\"Iraq\":\"964\",\"Iran\"\"Belize\":\"501\",\"CapeVerde\":\"238\",\"Russia\":\"7\",\"Bulgaria\":\"359\",\"Guam\":\"671\",\"Gambia\":\"220\",\"Iceland\":\"354\",\"Guinea\":\"224\",\"Guinea-Bissau\":\"245\",\"Liechtenstein\":\"4175\",\"Congo\":\"242\",\"Libya\":\"218\",\"Liberia\":\"231\",\"Canada\":\"1\",\"Ghana\":\"233\",\"Gabon\":\"241\",\"Hungary\":\"336\",\"Yugoslavia\":\"338\",\"SouthAfrica\":\"27\",\"Botswana\":\"267\",\"Qatar\":\"974\",\"Rwanda\":\"250\",\"Luxembourg\":\"352\",\"India\":\"91\",\"Indonesia\":\"62\",\"Guatemala\":\"502\",\"Ecuador\":\"593\",\"Syria\":\"963\",\"Cuba\":\"53\",\"Taiwan\":\"886\",\"Djibouti\":\"253\",\"Colombia\":\"57\",\"CostaRica\":\"506\",\"Cameroon\":\"237\",\"Tuvalu\":\"688\",\"Turkey\":\"90\"\"1809\",\"SaoTome\":\"239\",\"ChristmasIsland\":\"6724\",\"St.Helena\":\"290\",\"SanMarino\":\"223\",\"Guyana\":\"592\",\"Tanzania\":\"255\",\"EgyptAnd\":\"20\",\"Ethiopia\":\"251\",\"Kiribati\":\"686\",\"Senegal\":\"221\",\"SierraLeone\":\"232\",\"Cyprus\":\"357\"\"248\",\"Mexico\":\"52\",\"Hawaii\":\"1808\",\"Togo\":\"228\",\"Austria\":\"43\",\"Venezuela\":\"58\"Islands\":\"1808\",\"Bangladesh\":\"880\",\"Angola\":\"244\",\"Anguilla\":\"1809\",\"Nicaragua\":\"505\",\"Nigeria\":\"234\",\"Niger\":\"227\",\"Nepal\":\"977\",\"Bahamas\":\"1809\",\"Pakistan\":\"92\",\"Barbados\":\"1809\",\"Paraguay\":\"595\",\"Panama\":\"507\",\"Bahrain\":\"973\",\"Brazil\":\"55\",\"BurkinaFaso\":\"226\",\"Burundi\":\"257\",\"Greece\":\"30\",\"Germany\":\"349\",\"Italy\":\"39\",\"SolomonIslands\":\"677\",\"Zaire\":\"243\",\"Norway\":\"47\",\"Morocco\":\"210\",\"Brunei\":\"673\",\"Fiji\":\"679\",\"Swaziland\":\"268\",\"SriLanka\":\"94\",\"Singapore\":\"65\",\"NewZealand:\"64\",\"Japan\":\"81\",\"Príncipe\":\"239\",\"Chile\":\"56\",\"NorthKorea\":\"850\",\"Cambodia\":\"855\",\"Island\":\"299\",\"Vatican\":\"396\",\"Belgium\":\"32\",\"Mauritania\":\"222\",\"Mauritius\":\"230\",\"Tonga\":\"676\",\"SaudiArabia\":\"966\",\"\"French\":\"594\",\"FaroeIslands\":\"298\",\"Poland\":\"48\",\"PuertoRico\":\"1809\",\"Thailand\":\"66\",\"Zimbabwe\":\"263\",\"Honduras\":\"504\",\"Haiti\":\"509\",\"Australia\":\"61\",\"MacaoSpecialAdministrativeRegionofChina\":\"853\",\"Ireland\":\"353\"\"Jamaica\":\"1809\"\"Bolivia\":\"591\"\"Nauru\":\"674\"\"Sweden\":\"46\"\"Switzerland\":\"41\"\"Vanuatu\":\"678\",\"Reunion\":\"262\",\"Gibraltar\":\"350\",\"FalklandIslands\":\"500\",\"CorkIslands\":\"682\",\"Kuwait\":\"965\"Comoros\":\"269\",\"Côted'Ivoire\":\"225\",\"Cocos\":\"6722\",\"Peru\":\"51\",\"Tunisia\":\"216\",\"Somalia\":\"252\",\"Jordan\":\"962\";\"Namibia\":\"264\";\"Niue\":\"683\";\"VirginIslands\":\"1809\";\"Myanmar\";\"95\";\"Romania\":\"40\"UnitedStates\":\"1\",\"Laos\":\"856\",\"Kenya\":\"254\",\"Finland\":\"358\",\"Sudan\":\"249\",\"Suriname\":\"597\",\"UnitedKingdom\":\"44\",\"Netherlands\":\"31\",\"Mozambique\":\"258\",\"Lesotho\":\"266\",\"Philippines\":\"63\",\"ElSalvador\":\"503\",\"Portugal\":\"351\",\"Mongolia\":\"976\",\"Spain\":\"34\",\"WesternSamoa\":\"685\",\"NorfolkIsland\":\"6723\",\"Benin\":\"229\",\"Zambia\":\"260\",\"red.\"Guinea\":\"240\",\"Vietnam\":\"84\",\"Afghanistan\":\"93\",\"Algeria\":\"213\",\"Albania\":\"355\",\"Alaska\":\"1907\":\"968\",\"Argentina\":\"54\",\"Ascension\":\"247\",\"Aruba\":\"297\",\"Korea\":\u200B\u200B\"82\",\"HongKongofChina\":\"852\",\"Maldives\":\"960\",\"Malawi\":\"265\",\"Martinique\":\"596\",\"Malta\":\"356\",\"Madagascar\":\"261\",\"Mali:\"223\",\"Lebanon\":\"961\",\"Malaysia\":\"60\"";

	public static final String AREA_CODE_ZN = "\"不丹\":\"975\",\"东萨摩亚\":\"684\",\"中国\":\"86\",\"中途岛\":\"1808\",\"中非\":\"236\",\"丹麦\":\"45\",\"乌干达\":\"256\",\"乌拉圭\":\"598\",\"乍得\":\"235\",\"以色列\":\"972\",\"伊拉克\":\"964\",\"伊朗\":\"98\",\"伯利兹\":\"501\",\"佛得角\":\"238\",\"俄罗斯\":\"7\",\"保加利亚\":\"359\",\"关岛\":\"671\",\"冈比亚\":\"220\",\"冰岛\":\"354\",\"几内亚\":\"224\",\"几内亚比绍\":\"245\",\"列支敦士登\":\"4175\",\"刚果\":\"242\",\"利比亚\":\"218\",\"利比里亚\":\"231\",\"加拿大\":\"1\",\"加纳\":\"233\",\"加蓬\":\"241\",\"匈牙利\":\"336\",\"南斯拉夫\":\"338\",\"南非\":\"27\",\"博茨瓦纳\":\"267\",\"卡塔尔\":\"974\",\"卢旺达\":\"250\",\"卢森堡\":\"352\",\"印度\":\"91\",\"印度尼西亚\":\"62\",\"危地马拉\":\"502\",\"厄瓜多尔\":\"593\",\"叙利亚\":\"963\",\"古巴\":\"53\",\"台湾\":\"886\",\"吉布提\":\"253\",\"哥伦比亚\":\"57\",\"哥斯达黎加\":\"506\",\"喀麦隆\":\"237\",\"图瓦卢\":\"688\",\"土耳其\":\"90\",\"圣卢西亚\":\"1809\",\"圣多美\":\"239\",\"圣诞岛\":\"6724\",\"圣赫勒拿\":\"290\",\"圣马力诺\":\"223\",\"圭亚那\":\"592\",\"坦桑尼亚\":\"255\",\"埃及\":\"20\",\"埃塞俄比亚\":\"251\",\"基里巴斯\":\"686\",\"塞内加尔\":\"221\",\"塞拉利昂\":\"232\",\"塞浦路斯\":\"357\",\"塞舌尔\":\"248\",\"墨西哥\":\"52\",\"夏威夷\":\"1808\",\"多哥\":\"228\",\"奥地利\":\"43\",\"委内瑞拉\":\"58\",\"威克岛\":\"1808\",\"孟加拉国\":\"880\",\"安哥拉\":\"244\",\"安圭拉岛\":\"1809\",\"尼加拉瓜\":\"505\",\"尼日利亚\":\"234\",\"尼日尔\":\"227\",\"尼泊尔\":\"977\",\"巴哈马\":\"1809\",\"巴基斯坦\":\"92\",\"巴巴多斯\":\"1809\",\"巴拉圭\":\"595\",\"巴拿马\":\"507\",\"巴林\":\"973\",\"巴西\":\"55\",\"布基拉法索\":\"226\",\"布隆迪\":\"257\",\"希腊\":\"30\",\"德国\":\"349\",\"意大利\":\"39\",\"所罗门群岛\":\"677\",\"扎伊尔\":\"243\",\"挪威\":\"47\",\"摩洛哥\":\"210\",\"文莱\":\"673\",\"斐济\":\"679\",\"斯威士兰\":\"268\",\"斯里兰卡\":\"94\",\"新加坡\":\"65\",\"新西兰\":\"64\",\"日本\":\"81\",\"普林西比\":\"239\",\"智利\":\"56\",\"朝鲜\":\"850\",\"柬埔寨\":\"855\",\"格陵兰岛\":\"299\",\"梵蒂冈\":\"396\",\"比利时\":\"32\",\"毛里塔尼亚\":\"222\",\"毛里求斯\":\"230\",\"汤加\":\"676\",\"沙特阿拉伯\":\"966\",\"法国\":\"33\",\"法属圭亚那\":\"594\",\"法罗群岛\":\"298\",\"波兰\":\"48\",\"波多黎各\":\"1809\",\"泰国\":\"66\",\"津巴布韦\":\"263\",\"洪都拉斯\":\"504\",\"海地\":\"509\",\"澳大利亚\":\"61\",\"中国澳门特别行政区\":\"853\",\"爱尔兰\":\"353\",\"牙买加\":\"1809\",\"玻利维亚\":\"591\",\"瑙鲁\":\"674\",\"瑞典\":\"46\",\"瑞士\":\"41\",\"瓦努阿图\":\"678\",\"留尼旺岛\":\"262\",\"直布罗陀\":\"350\",\"福克兰群岛\":\"500\",\"科克群岛\":\"682\",\"科威特\":\"965\",\"科摩罗\":\"269\",\"科特迪瓦\":\"225\",\"科科斯岛\":\"6722\",\"秘鲁\":\"51\",\"突尼斯\":\"216\",\"索马里\":\"252\",\"约旦\":\"962\",\"纳米比亚\":\"264\",\"纽埃岛\":\"683\",\"维尔京群岛\":\"1809\",\"缅甸\":\"95\",\"罗马尼亚\":\"40\",\"美国\":\"1\",\"老挝\":\"856\",\"肯尼亚\":\"254\",\"芬兰\":\"358\",\"苏丹\":\"249\",\"苏里南\":\"597\",\"英国\":\"44\",\"荷兰\":\"31\",\"莫桑比克\":\"258\",\"莱索托\":\"266\",\"菲律宾\":\"63\",\"萨尔瓦多\":\"503\",\"葡萄牙\":\"351\",\"蒙古\":\"976\",\"西班牙\":\"34\",\"西萨摩亚\":\"685\",\"诺福克岛\":\"6723\",\"贝宁\":\"229\",\"赞比亚\":\"260\",\"赤道几内亚\":\"240\",\"越南\":\"84\",\"阿富汗\":\"93\",\"阿尔及利亚\":\"213\",\"阿尔巴尼亚\":\"355\",\"阿拉斯加\":\"1907\",\"阿曼\":\"968\",\"阿根廷\":\"54\",\"阿森松\":\"247\",\"阿鲁巴岛\":\"297\",\"韩国\":\"82\",\"中国香港特别行政区\":\"852\",\"马尔代夫\":\"960\",\"马拉维\":\"265\",\"马提尼克\":\"596\",\"马耳他\":\"356\",\"马达加斯加\":\"261\",\"马里\":\"223\",\"黎巴嫩\":\"961\",\"马来西亚\":\"60\"";

	public static final String city = "[\n" +
			"    {\n" +
			"        \"code\": 1,\n" +
			"        \"ZN\": \"美国 \",\n" +
			"        \"EN\": \"United States\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1,\n" +
			"        \"ZN\": \"加拿大 \",\n" +
			"        \"EN\": \"Canada\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1242,\n" +
			"        \"ZN\": \"巴哈马 \",\n" +
			"        \"EN\": \"Bahamas\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1246,\n" +
			"        \"ZN\": \"巴巴多斯 \",\n" +
			"        \"EN\": \"Barbados\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1264,\n" +
			"        \"ZN\": \"安圭拉 \",\n" +
			"        \"EN\": \"Anguilla\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1268,\n" +
			"        \"ZN\": \"安提瓜和巴布达 \",\n" +
			"        \"EN\": \"Antigua and Barbuda\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1284,\n" +
			"        \"ZN\": \"英属维京群岛 \",\n" +
			"        \"EN\": \"British Virgin Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1340,\n" +
			"        \"ZN\": \"美属维京群岛 \",\n" +
			"        \"EN\": \"U.S. Virgin Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1345,\n" +
			"        \"ZN\": \"开曼群岛 \",\n" +
			"        \"EN\": \"Cayman Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1441,\n" +
			"        \"ZN\": \"百慕大 \",\n" +
			"        \"EN\": \"Bermuda\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1473,\n" +
			"        \"ZN\": \"格林纳达 \",\n" +
			"        \"EN\": \"Grenada\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1649,\n" +
			"        \"ZN\": \"特克斯和凯科斯群岛 \",\n" +
			"        \"EN\": \"Turks and Caicos Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1664,\n" +
			"        \"ZN\": \"蒙塞拉特 \",\n" +
			"        \"EN\": \"Montserrat\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1670,\n" +
			"        \"ZN\": \"北马里亚纳群岛 \",\n" +
			"        \"EN\": \"Northern Mariana Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1671,\n" +
			"        \"ZN\": \"关岛 \",\n" +
			"        \"EN\": \"Guam\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1684,\n" +
			"        \"ZN\": \"美属萨摩亚 \",\n" +
			"        \"EN\": \"American Samoa\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1721,\n" +
			"        \"ZN\": \"荷属圣马丁 \",\n" +
			"        \"EN\": \"Sint Maarten\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1758,\n" +
			"        \"ZN\": \"圣卢西亚 \",\n" +
			"        \"EN\": \"Saint Lucia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1767,\n" +
			"        \"ZN\": \"多米尼克 \",\n" +
			"        \"EN\": \"Dominica\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1784,\n" +
			"        \"ZN\": \"圣文森特和格林纳丁斯 \",\n" +
			"        \"EN\": \"Saint Vincent and the Grenadines\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1787,\n" +
			"        \"ZN\": \"波多黎各 \",\n" +
			"        \"EN\": \"Puerto Rico\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1809,\n" +
			"        \"ZN\": \"多米尼加共和国 \",\n" +
			"        \"EN\": \"República Dominicana\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1868,\n" +
			"        \"ZN\": \"特立尼达和多巴哥 \",\n" +
			"        \"EN\": \"Trinidad and Tobago\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1869,\n" +
			"        \"ZN\": \"圣基茨和尼维斯 \",\n" +
			"        \"EN\": \"Saint Kitts and Nevis\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 1876,\n" +
			"        \"ZN\": \"牙买加 \",\n" +
			"        \"EN\": \"Jamaica\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 20,\n" +
			"        \"ZN\": \"埃及 \",\n" +
			"        \"EN\": \"\\u202bمصر\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 211,\n" +
			"        \"ZN\": \"南苏丹 \",\n" +
			"        \"EN\": \"\\u202bجنوب السودان\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 212,\n" +
			"        \"ZN\": \"摩洛哥 \",\n" +
			"        \"EN\": \"\\u202bالمغرب\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 213,\n" +
			"        \"ZN\": \"阿尔及利亚 \",\n" +
			"        \"EN\": \"\\u202bالجزائر\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 216,\n" +
			"        \"ZN\": \"突尼斯 \",\n" +
			"        \"EN\": \"\\u202bتونس\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 218,\n" +
			"        \"ZN\": \"利比亚 \",\n" +
			"        \"EN\": \"\\u202bليبيا\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 220,\n" +
			"        \"ZN\": \"冈比亚 \",\n" +
			"        \"EN\": \"Gambia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 221,\n" +
			"        \"ZN\": \"塞内加尔 \",\n" +
			"        \"EN\": \"Sénégal\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 222,\n" +
			"        \"ZN\": \"毛里塔尼亚 \",\n" +
			"        \"EN\": \"\\u202bموريتانيا\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 223,\n" +
			"        \"ZN\": \"马里 \",\n" +
			"        \"EN\": \"Mali\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 224,\n" +
			"        \"ZN\": \"几内亚 \",\n" +
			"        \"EN\": \"Guinée\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 225,\n" +
			"        \"ZN\": \"科特迪瓦 \",\n" +
			"        \"EN\": \"Côte d’Ivoire\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 226,\n" +
			"        \"ZN\": \"布基纳法索 \",\n" +
			"        \"EN\": \"Burkina Faso\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 227,\n" +
			"        \"ZN\": \"尼日尔 \",\n" +
			"        \"EN\": \"Nijar\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 228,\n" +
			"        \"ZN\": \"多哥 \",\n" +
			"        \"EN\": \"Togo\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 229,\n" +
			"        \"ZN\": \"贝宁 \",\n" +
			"        \"EN\": \"Bénin\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 230,\n" +
			"        \"ZN\": \"毛里求斯 \",\n" +
			"        \"EN\": \"Moris\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 231,\n" +
			"        \"ZN\": \"利比里亚 \",\n" +
			"        \"EN\": \"Liberia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 232,\n" +
			"        \"ZN\": \"塞拉利昂 \",\n" +
			"        \"EN\": \"Sierra Leone\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 233,\n" +
			"        \"ZN\": \"加纳 \",\n" +
			"        \"EN\": \"Gaana\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 234,\n" +
			"        \"ZN\": \"尼日利亚 \",\n" +
			"        \"EN\": \"Nigeria\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 235,\n" +
			"        \"ZN\": \"乍得 \",\n" +
			"        \"EN\": \"Tchad\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 236,\n" +
			"        \"ZN\": \"中非共和国 \",\n" +
			"        \"EN\": \"République centrafricaine\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 237,\n" +
			"        \"ZN\": \"喀麦隆 \",\n" +
			"        \"EN\": \"Cameroun\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 238,\n" +
			"        \"ZN\": \"佛得角 \",\n" +
			"        \"EN\": \"Kabu Verdi\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 239,\n" +
			"        \"ZN\": \"圣多美和普林西比 \",\n" +
			"        \"EN\": \"São Tomé e Príncipe\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 240,\n" +
			"        \"ZN\": \"赤道几内亚 \",\n" +
			"        \"EN\": \"Guinea Ecuatorial\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 241,\n" +
			"        \"ZN\": \"加蓬 \",\n" +
			"        \"EN\": \"Gabon\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 242,\n" +
			"        \"ZN\": \"刚果（布） \",\n" +
			"        \"EN\": \"Congo-Brazzaville\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 243,\n" +
			"        \"ZN\": \"刚果（金） \",\n" +
			"        \"EN\": \"Jamhuri ya Kidemokrasia ya Kongo\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 244,\n" +
			"        \"ZN\": \"安哥拉 \",\n" +
			"        \"EN\": \"Angola\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 245,\n" +
			"        \"ZN\": \"几内亚比绍 \",\n" +
			"        \"EN\": \"Guiné Bissau\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 246,\n" +
			"        \"ZN\": \"英属印度洋领地 \",\n" +
			"        \"EN\": \"British Indian Ocean Territory\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 247,\n" +
			"        \"ZN\": \"阿森松岛 \",\n" +
			"        \"EN\": \"Ascension Island\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 248,\n" +
			"        \"ZN\": \"塞舌尔 \",\n" +
			"        \"EN\": \"Seychelles\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 249,\n" +
			"        \"ZN\": \"苏丹 \",\n" +
			"        \"EN\": \"\\u202bالسودان\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 250,\n" +
			"        \"ZN\": \"卢旺达 \",\n" +
			"        \"EN\": \"Rwanda\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 251,\n" +
			"        \"ZN\": \"埃塞俄比亚 \",\n" +
			"        \"EN\": \"Ethiopia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 252,\n" +
			"        \"ZN\": \"索马里 \",\n" +
			"        \"EN\": \"Soomaaliya\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 253,\n" +
			"        \"ZN\": \"吉布提 \",\n" +
			"        \"EN\": \"Djibouti\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 254,\n" +
			"        \"ZN\": \"肯尼亚 \",\n" +
			"        \"EN\": \"Kenya\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 255,\n" +
			"        \"ZN\": \"坦桑尼亚 \",\n" +
			"        \"EN\": \"Tanzania\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 256,\n" +
			"        \"ZN\": \"乌干达 \",\n" +
			"        \"EN\": \"Uganda\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 257,\n" +
			"        \"ZN\": \"布隆迪 \",\n" +
			"        \"EN\": \"Uburundi\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 258,\n" +
			"        \"ZN\": \"莫桑比克 \",\n" +
			"        \"EN\": \"Moçambique\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 260,\n" +
			"        \"ZN\": \"赞比亚 \",\n" +
			"        \"EN\": \"Zambia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 261,\n" +
			"        \"ZN\": \"马达加斯加 \",\n" +
			"        \"EN\": \"Madagasikara\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 262,\n" +
			"        \"ZN\": \"留尼汪 \",\n" +
			"        \"EN\": \"Réunion\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 263,\n" +
			"        \"ZN\": \"津巴布韦 \",\n" +
			"        \"EN\": \"Zimbabwe\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 264,\n" +
			"        \"ZN\": \"纳米比亚 \",\n" +
			"        \"EN\": \"Namibia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 265,\n" +
			"        \"ZN\": \"马拉维 \",\n" +
			"        \"EN\": \"Malawi\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 266,\n" +
			"        \"ZN\": \"莱索托 \",\n" +
			"        \"EN\": \"Lesotho\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 267,\n" +
			"        \"ZN\": \"博茨瓦纳 \",\n" +
			"        \"EN\": \"Botswana\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 268,\n" +
			"        \"ZN\": \"斯威士兰 \",\n" +
			"        \"EN\": \"Swaziland\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 269,\n" +
			"        \"ZN\": \"科摩罗 \",\n" +
			"        \"EN\": \"\\u202bجزر القمر\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 27,\n" +
			"        \"ZN\": \"南非 \",\n" +
			"        \"EN\": \"South Africa\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 290,\n" +
			"        \"ZN\": \"圣赫勒拿 \",\n" +
			"        \"EN\": \"Saint Helena\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 291,\n" +
			"        \"ZN\": \"厄立特里亚 \",\n" +
			"        \"EN\": \"Eritrea\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 297,\n" +
			"        \"ZN\": \"阿鲁巴 \",\n" +
			"        \"EN\": \"Aruba\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 298,\n" +
			"        \"ZN\": \"法罗群岛 \",\n" +
			"        \"EN\": \"Føroyar\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 299,\n" +
			"        \"ZN\": \"格陵兰 \",\n" +
			"        \"EN\": \"Kalaallit Nunaat\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 30,\n" +
			"        \"ZN\": \"希腊 \",\n" +
			"        \"EN\": \"Ελλάδα\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 31,\n" +
			"        \"ZN\": \"荷兰 \",\n" +
			"        \"EN\": \"Nederland\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 32,\n" +
			"        \"ZN\": \"比利时 \",\n" +
			"        \"EN\": \"België\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 33,\n" +
			"        \"ZN\": \"法国 \",\n" +
			"        \"EN\": \"France\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 34,\n" +
			"        \"ZN\": \"西班牙 \",\n" +
			"        \"EN\": \"España\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 350,\n" +
			"        \"ZN\": \"直布罗陀 \",\n" +
			"        \"EN\": \"Gibraltar\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 351,\n" +
			"        \"ZN\": \"葡萄牙 \",\n" +
			"        \"EN\": \"Portugal\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 352,\n" +
			"        \"ZN\": \"卢森堡 \",\n" +
			"        \"EN\": \"Luxembourg\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 353,\n" +
			"        \"ZN\": \"爱尔兰 \",\n" +
			"        \"EN\": \"Ireland\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 354,\n" +
			"        \"ZN\": \"冰岛 \",\n" +
			"        \"EN\": \"Ísland\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 355,\n" +
			"        \"ZN\": \"阿尔巴尼亚 \",\n" +
			"        \"EN\": \"Shqipëria\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 356,\n" +
			"        \"ZN\": \"马耳他 \",\n" +
			"        \"EN\": \"Malta\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 357,\n" +
			"        \"ZN\": \"塞浦路斯 \",\n" +
			"        \"EN\": \"Κύπρος\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 358,\n" +
			"        \"ZN\": \"芬兰 \",\n" +
			"        \"EN\": \"Suomi\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 359,\n" +
			"        \"ZN\": \"保加利亚 \",\n" +
			"        \"EN\": \"България\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 36,\n" +
			"        \"ZN\": \"匈牙利 \",\n" +
			"        \"EN\": \"Magyarország\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 370,\n" +
			"        \"ZN\": \"立陶宛 \",\n" +
			"        \"EN\": \"Lietuva\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 371,\n" +
			"        \"ZN\": \"拉脱维亚 \",\n" +
			"        \"EN\": \"Latvija\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 372,\n" +
			"        \"ZN\": \"爱沙尼亚 \",\n" +
			"        \"EN\": \"Eesti\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 373,\n" +
			"        \"ZN\": \"摩尔多瓦 \",\n" +
			"        \"EN\": \"Republica Moldova\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 374,\n" +
			"        \"ZN\": \"亚美尼亚 \",\n" +
			"        \"EN\": \"Հայաստան\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 375,\n" +
			"        \"ZN\": \"白俄罗斯 \",\n" +
			"        \"EN\": \"Беларусь\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 376,\n" +
			"        \"ZN\": \"安道尔 \",\n" +
			"        \"EN\": \"Andorra\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 377,\n" +
			"        \"ZN\": \"摩纳哥 \",\n" +
			"        \"EN\": \"Monaco\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 378,\n" +
			"        \"ZN\": \"圣马力诺 \",\n" +
			"        \"EN\": \"San Marino\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 379,\n" +
			"        \"ZN\": \"梵蒂冈 \",\n" +
			"        \"EN\": \"Città del Vaticano\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 380,\n" +
			"        \"ZN\": \"乌克兰 \",\n" +
			"        \"EN\": \"Україна\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 381,\n" +
			"        \"ZN\": \"塞尔维亚 \",\n" +
			"        \"EN\": \"Србија\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 382,\n" +
			"        \"ZN\": \"黑山共和国 \",\n" +
			"        \"EN\": \"Crna Gora\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 385,\n" +
			"        \"ZN\": \"克罗地亚 \",\n" +
			"        \"EN\": \"Hrvatska\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 386,\n" +
			"        \"ZN\": \"斯洛文尼亚 \",\n" +
			"        \"EN\": \"Slovenija\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 387,\n" +
			"        \"ZN\": \"波斯尼亚和黑塞哥维那 \",\n" +
			"        \"EN\": \"Босна и Херцеговина\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 389,\n" +
			"        \"ZN\": \"马其顿 \",\n" +
			"        \"EN\": \"Македонија\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 39,\n" +
			"        \"ZN\": \"意大利 \",\n" +
			"        \"EN\": \"Italia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 40,\n" +
			"        \"ZN\": \"罗马尼亚 \",\n" +
			"        \"EN\": \"România\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 41,\n" +
			"        \"ZN\": \"瑞士 \",\n" +
			"        \"EN\": \"Schweiz\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 420,\n" +
			"        \"ZN\": \"捷克共和国 \",\n" +
			"        \"EN\": \"Česká republika\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 421,\n" +
			"        \"ZN\": \"斯洛伐克 \",\n" +
			"        \"EN\": \"Slovensko\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 423,\n" +
			"        \"ZN\": \"列支敦士登 \",\n" +
			"        \"EN\": \"Liechtenstein\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 43,\n" +
			"        \"ZN\": \"奥地利 \",\n" +
			"        \"EN\": \"Österreich\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 44,\n" +
			"        \"ZN\": \"英国 \",\n" +
			"        \"EN\": \"United Kingdom\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 45,\n" +
			"        \"ZN\": \"丹麦 \",\n" +
			"        \"EN\": \"Danmark\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 46,\n" +
			"        \"ZN\": \"瑞典 \",\n" +
			"        \"EN\": \"Sverige\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 47,\n" +
			"        \"ZN\": \"挪威 \",\n" +
			"        \"EN\": \"Norge\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 48,\n" +
			"        \"ZN\": \"波兰 \",\n" +
			"        \"EN\": \"Polska\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 49,\n" +
			"        \"ZN\": \"德国 \",\n" +
			"        \"EN\": \"Deutschland\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 500,\n" +
			"        \"ZN\": \"福克兰群岛 \",\n" +
			"        \"EN\": \"Falkland Islands [Islas Malvinas]\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 501,\n" +
			"        \"ZN\": \"伯利兹 \",\n" +
			"        \"EN\": \"Belize\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 502,\n" +
			"        \"ZN\": \"危地马拉 \",\n" +
			"        \"EN\": \"Guatemala\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 503,\n" +
			"        \"ZN\": \"萨尔瓦多 \",\n" +
			"        \"EN\": \"El Salvador\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 504,\n" +
			"        \"ZN\": \"洪都拉斯 \",\n" +
			"        \"EN\": \"Honduras\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 505,\n" +
			"        \"ZN\": \"尼加拉瓜 \",\n" +
			"        \"EN\": \"Nicaragua\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 506,\n" +
			"        \"ZN\": \"哥斯达黎加 \",\n" +
			"        \"EN\": \"Costa Rica\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 507,\n" +
			"        \"ZN\": \"巴拿马 \",\n" +
			"        \"EN\": \"Panamá\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 508,\n" +
			"        \"ZN\": \"圣皮埃尔和密克隆群岛 \",\n" +
			"        \"EN\": \"Saint-Pierre-et-Miquelon\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 509,\n" +
			"        \"ZN\": \"海地 \",\n" +
			"        \"EN\": \"Haiti\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 51,\n" +
			"        \"ZN\": \"秘鲁 \",\n" +
			"        \"EN\": \"Perú\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 52,\n" +
			"        \"ZN\": \"墨西哥 \",\n" +
			"        \"EN\": \"México\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 53,\n" +
			"        \"ZN\": \"古巴 \",\n" +
			"        \"EN\": \"Cuba\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 54,\n" +
			"        \"ZN\": \"阿根廷 \",\n" +
			"        \"EN\": \"Argentina\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 55,\n" +
			"        \"ZN\": \"巴西 \",\n" +
			"        \"EN\": \"Brasil\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 56,\n" +
			"        \"ZN\": \"智利 \",\n" +
			"        \"EN\": \"Chile\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 57,\n" +
			"        \"ZN\": \"哥伦比亚 \",\n" +
			"        \"EN\": \"Colombia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 58,\n" +
			"        \"ZN\": \"委内瑞拉 \",\n" +
			"        \"EN\": \"Venezuela\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 590,\n" +
			"        \"ZN\": \"法属圣马丁 \",\n" +
			"        \"EN\": \"Saint-Martin [partie française]\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 590,\n" +
			"        \"ZN\": \"瓜德罗普岛 \",\n" +
			"        \"EN\": \"Guadeloupe\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 590,\n" +
			"        \"ZN\": \"圣巴泰勒米 \",\n" +
			"        \"EN\": \"Saint-Barthélémy\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 591,\n" +
			"        \"ZN\": \"玻利维亚 \",\n" +
			"        \"EN\": \"Bolivia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 592,\n" +
			"        \"ZN\": \"圭亚那 \",\n" +
			"        \"EN\": \"Guyana\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 593,\n" +
			"        \"ZN\": \"厄瓜多尔 \",\n" +
			"        \"EN\": \"Ecuador\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 594,\n" +
			"        \"ZN\": \"法属圭亚那 \",\n" +
			"        \"EN\": \"Guyane française\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 595,\n" +
			"        \"ZN\": \"巴拉圭 \",\n" +
			"        \"EN\": \"Paraguay\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 596,\n" +
			"        \"ZN\": \"马提尼克 \",\n" +
			"        \"EN\": \"Martinique\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 597,\n" +
			"        \"ZN\": \"苏里南 \",\n" +
			"        \"EN\": \"Suriname\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 598,\n" +
			"        \"ZN\": \"乌拉圭 \",\n" +
			"        \"EN\": \"Uruguay\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 599,\n" +
			"        \"ZN\": \"荷兰加勒比 \",\n" +
			"        \"EN\": \"Caribbean Netherlands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 599,\n" +
			"        \"ZN\": \"库拉索 \",\n" +
			"        \"EN\": \"Curaçao\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 60,\n" +
			"        \"ZN\": \"马来西亚 \",\n" +
			"        \"EN\": \"Malaysia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 61,\n" +
			"        \"ZN\": \"澳大利亚 \",\n" +
			"        \"EN\": \"Australia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 62,\n" +
			"        \"ZN\": \"印度尼西亚 \",\n" +
			"        \"EN\": \"Indonesia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 63,\n" +
			"        \"ZN\": \"菲律宾 \",\n" +
			"        \"EN\": \"Philippines\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 64,\n" +
			"        \"ZN\": \"新西兰 \",\n" +
			"        \"EN\": \"New Zealand\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 65,\n" +
			"        \"ZN\": \"新加坡 \",\n" +
			"        \"EN\": \"Singapore\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 66,\n" +
			"        \"ZN\": \"泰国 \",\n" +
			"        \"EN\": \"ไทย\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 670,\n" +
			"        \"ZN\": \"东帝汶 \",\n" +
			"        \"EN\": \"Timor-Leste\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 6723,\n" +
			"        \"ZN\": \"诺福克岛 \",\n" +
			"        \"EN\": \"Norfolk Island\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 673,\n" +
			"        \"ZN\": \"文莱 \",\n" +
			"        \"EN\": \"Brunei\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 674,\n" +
			"        \"ZN\": \"瑙鲁 \",\n" +
			"        \"EN\": \"Nauru\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 675,\n" +
			"        \"ZN\": \"巴布亚新几内亚 \",\n" +
			"        \"EN\": \"Papua New Guinea\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 676,\n" +
			"        \"ZN\": \"汤加 \",\n" +
			"        \"EN\": \"Tonga\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 677,\n" +
			"        \"ZN\": \"所罗门群岛 \",\n" +
			"        \"EN\": \"Solomon Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 678,\n" +
			"        \"ZN\": \"瓦努阿图 \",\n" +
			"        \"EN\": \"Vanuatu\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 679,\n" +
			"        \"ZN\": \"斐济 \",\n" +
			"        \"EN\": \"Fiji\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 680,\n" +
			"        \"ZN\": \"帕劳 \",\n" +
			"        \"EN\": \"Palau\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 681,\n" +
			"        \"ZN\": \"瓦利斯和富图纳 \",\n" +
			"        \"EN\": \"Wallis and Futuna\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 682,\n" +
			"        \"ZN\": \"库克群岛 \",\n" +
			"        \"EN\": \"Cook Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 683,\n" +
			"        \"ZN\": \"纽埃 \",\n" +
			"        \"EN\": \"Niue\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 685,\n" +
			"        \"ZN\": \"萨摩亚 \",\n" +
			"        \"EN\": \"Samoa\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 686,\n" +
			"        \"ZN\": \"基里巴斯 \",\n" +
			"        \"EN\": \"Kiribati\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 687,\n" +
			"        \"ZN\": \"新喀里多尼亚 \",\n" +
			"        \"EN\": \"Nouvelle-Calédonie\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 688,\n" +
			"        \"ZN\": \"图瓦卢 \",\n" +
			"        \"EN\": \"Tuvalu\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 689,\n" +
			"        \"ZN\": \"法属波利尼西亚 \",\n" +
			"        \"EN\": \"Polynésie française\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 690,\n" +
			"        \"ZN\": \"托克劳 \",\n" +
			"        \"EN\": \"Tokelau\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 691,\n" +
			"        \"ZN\": \"密克罗尼西亚联邦 \",\n" +
			"        \"EN\": \"Micronesia\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 692,\n" +
			"        \"ZN\": \"马绍尔群岛 \",\n" +
			"        \"EN\": \"Marshall Islands\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 7,\n" +
			"        \"ZN\": \"俄罗斯 \",\n" +
			"        \"EN\": \"Россия\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 7,\n" +
			"        \"ZN\": \"哈萨克斯坦 \",\n" +
			"        \"EN\": \"Казахстан\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 81,\n" +
			"        \"ZN\": \"日本\",\n" +
			"        \"EN\": \"日本\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 82,\n" +
			"        \"ZN\": \"韩国 \",\n" +
			"        \"EN\": \"대한민국\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 84,\n" +
			"        \"ZN\": \"越南 \",\n" +
			"        \"EN\": \"Việt Nam\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 850,\n" +
			"        \"ZN\": \"朝鲜 \",\n" +
			"        \"EN\": \"조선 민주주의 인민 공화국\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 852,\n" +
			"        \"ZN\": \"香港\",\n" +
			"        \"EN\": \"香港\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 853,\n" +
			"        \"ZN\": \"澳门 \",\n" +
			"        \"EN\": \"澳門\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 855,\n" +
			"        \"ZN\": \"柬埔寨 \",\n" +
			"        \"EN\": \"កម្ពុជា\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 856,\n" +
			"        \"ZN\": \"老挝 \",\n" +
			"        \"EN\": \"ສ.ປ.ປ ລາວ\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 86,\n" +
			"        \"ZN\": \"中国\",\n" +
			"        \"EN\": \"中国\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 880,\n" +
			"        \"ZN\": \"孟加拉国 \",\n" +
			"        \"EN\": \"বাংলাদেশ\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 886,\n" +
			"        \"ZN\": \"台湾 \",\n" +
			"        \"EN\": \"台灣\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 90,\n" +
			"        \"ZN\": \"土耳其 \",\n" +
			"        \"EN\": \"Türkiye\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 91,\n" +
			"        \"ZN\": \"印度 \",\n" +
			"        \"EN\": \"भारत\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 92,\n" +
			"        \"ZN\": \"巴基斯坦 \",\n" +
			"        \"EN\": \"\\u202bپاکستان\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 93,\n" +
			"        \"ZN\": \"阿富汗 \",\n" +
			"        \"EN\": \"\\u202bافغانستان\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 94,\n" +
			"        \"ZN\": \"斯里兰卡 \",\n" +
			"        \"EN\": \"ශ්\\u200dරී ලංකාව\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 95,\n" +
			"        \"ZN\": \"缅甸 \",\n" +
			"        \"EN\": \"မြန်မာ\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 960,\n" +
			"        \"ZN\": \"马尔代夫 \",\n" +
			"        \"EN\": \"Maldives\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 961,\n" +
			"        \"ZN\": \"黎巴嫩 \",\n" +
			"        \"EN\": \"\\u202bلبنان\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 962,\n" +
			"        \"ZN\": \"约旦 \",\n" +
			"        \"EN\": \"\\u202bالأردن\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 963,\n" +
			"        \"ZN\": \"叙利亚 \",\n" +
			"        \"EN\": \"\\u202bسوريا\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 964,\n" +
			"        \"ZN\": \"伊拉克 \",\n" +
			"        \"EN\": \"\\u202bالعراق\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 965,\n" +
			"        \"ZN\": \"科威特 \",\n" +
			"        \"EN\": \"\\u202bالكويت\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 966,\n" +
			"        \"ZN\": \"沙特阿拉伯 \",\n" +
			"        \"EN\": \"\\u202bالمملكة العربية السعودية\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 967,\n" +
			"        \"ZN\": \"也门 \",\n" +
			"        \"EN\": \"\\u202bاليمن\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 968,\n" +
			"        \"ZN\": \"阿曼 \",\n" +
			"        \"EN\": \"\\u202bعُمان\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 970,\n" +
			"        \"ZN\": \"巴勒斯坦 \",\n" +
			"        \"EN\": \"\\u202bفلسطين\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 971,\n" +
			"        \"ZN\": \"阿拉伯联合酋长国 \",\n" +
			"        \"EN\": \"\\u202bالإمارات العربية المتحدة\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 972,\n" +
			"        \"ZN\": \"以色列 \",\n" +
			"        \"EN\": \"\\u202bישראל\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 973,\n" +
			"        \"ZN\": \"巴林 \",\n" +
			"        \"EN\": \"\\u202bالبحرين\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 974,\n" +
			"        \"ZN\": \"卡塔尔 \",\n" +
			"        \"EN\": \"\\u202bقطر\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 975,\n" +
			"        \"ZN\": \"不丹 \",\n" +
			"        \"EN\": \"འབྲུག\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 976,\n" +
			"        \"ZN\": \"蒙古 \",\n" +
			"        \"EN\": \"Монгол\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 977,\n" +
			"        \"ZN\": \"尼泊尔 \",\n" +
			"        \"EN\": \"नेपाल\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 98,\n" +
			"        \"ZN\": \"伊朗 \",\n" +
			"        \"EN\": \"\\u202bایران\\u202c\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 992,\n" +
			"        \"ZN\": \"塔吉克斯坦 \",\n" +
			"        \"EN\": \"Tajikistan\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 993,\n" +
			"        \"ZN\": \"土库曼斯坦 \",\n" +
			"        \"EN\": \"Turkmenistan\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 994,\n" +
			"        \"ZN\": \"阿塞拜疆 \",\n" +
			"        \"EN\": \"Azərbaycan\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 995,\n" +
			"        \"ZN\": \"格鲁吉亚 \",\n" +
			"        \"EN\": \"საქართველო\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 996,\n" +
			"        \"ZN\": \"吉尔吉斯斯坦 \",\n" +
			"        \"EN\": \"Kyrgyzstan\"\n" +
			"    },\n" +
			"    {\n" +
			"        \"code\": 998,\n" +
			"        \"ZN\": \"乌兹别克斯坦 \",\n" +
			"        \"EN\": \"Ўзбекистон\"\n" +
			"    }\n" +
			"]";

	public static List<KeyValues> chinaAreaCode = null;

	public static List<KeyValues> englishAreaCode = null;

	public static List<City> parseCity(){
		List<City> cities = com.alibaba.fastjson.JSONObject.parseArray(city, City.class);
		return cities;
	}

	public static List<KeyValues> getAreaCode(Integer locale){
		if (locale == LocaleEnum.ZH_CN.getCode() || locale == LocaleEnum.ZH_TW.getCode()){
			if (chinaAreaCode != null && chinaAreaCode.size()>0){
				return chinaAreaCode;
			}
			chinaAreaCode = parserAreaCode(AREA_CODE_ZN);
			return chinaAreaCode;
		}else{
			if (englishAreaCode != null && englishAreaCode.size()>0){
				return englishAreaCode;
			}
			englishAreaCode = parserAreaCode(AREA_CODE_EN);
			return englishAreaCode;
		}
	}

	private static List<KeyValues> parserAreaCode(String areaCode){
		if (TextUtils.isEmpty(areaCode)){
			return new ArrayList<>();
		}
		areaCode.replace("\n","");
		areaCode.replace(" ","");
		String[] split = areaCode.split(",");
		List<KeyValues> keyValuesList = new ArrayList<>();
		for (int i = 0; i < split.length; i++) {
			String cell = split[i];
			String[] split1 = cell.split(":");

			KeyValues keyValues = new KeyValues();
			keyValues.setKey(split1[0].substring(1,split1[0].length()-1).replace("\n","").trim());
			keyValues.setValue(split1[1].substring(1,split1[1].length()-1).replace("\n","").trim());
			keyValuesList.add(keyValues);
		}
		return keyValuesList;
	}

	/**
	 * 根据当前语言获取错误消息
	 * 
	 * @param key
	 * @return msg
	 */
	public static String GetR18nMsg(HttpServletRequest request,String key) {
		RequestContext requestContext = new RequestContext(request);
		return requestContext.getMessage(key);
	}

	/**
	 * 根据当前语言获取错误消息
	 * 
	 * @param key
	 * @param args
	 * @return msg
	 */
	public static String GetR18nMsg(HttpServletRequest request,String key, Object... args) {
		RequestContext requestContext = new RequestContext(request);
		String msg = "";
		try {
			msg = String.format(requestContext.getMessage(key), args);
		} catch (Exception e) {
			msg = requestContext.getMessage(key);
		}
		return msg;
	}
	/**
	 * 获取语言包简称
	 * 
	 * @return en,cn,tw
	 */
	public static String getLanguageShotName(HttpServletRequest request) {
		return RequestContextUtils.getLocaleResolver(request).resolveLocale(request).toString();
	}

	/**
	 * app服务端组装返回json
	 * @param code 返回值的编码
	 * @param key 错误消息key
	 * @return JSON格式的 字符串
	 */
	public static String GetAppR18nMsg(HttpServletRequest request,int code, String key) {
		JSONObject jsonObject = new JSONObject();
		String msg = "";
		if (!key.isEmpty()) {
			RequestContext requestContext = new RequestContext(request);
			try {
				msg = requestContext.getMessage(key);
			} catch (Exception e) {

			}
		}
		jsonObject.accumulate("resultCode", code);
		jsonObject.accumulate("resultMsg", msg);
		return jsonObject.toString();
	}
	
	/**
	 * app服务端组装返回json
	 * @param code 返回值的编码
	 * @param msg JSONObject格式数据
	 * @return JSON格式的 字符串
	 */
	public static String GetAppR18nMsg(int code, JSONObject msg) {
		JSONObject jsonObject = new JSONObject();		
		jsonObject.accumulate("resultCode", code);
		jsonObject.accumulate("resultMsg", msg.toString());
		return jsonObject.toString();
	}
	/**
	 * app服务端组装返回json
	 * @param code 返回值的编码
	 * @param msg JSONObject格式数据
	 * @return JSON格式的 字符串
	 */
	public static String GetAppR18nMsg(int code, JSONArray msg) {
		JSONObject jsonObject = new JSONObject();		
		jsonObject.accumulate("resultCode", code);
		jsonObject.accumulate("resultMsg", msg.toString());
		return jsonObject.toString();
	}
	
	/**
	 * app服务端组装返回json
	 * @param code 返回值的编码
	 * @param msg  String格式数据
	 * @return JSON格式的 字符串
	 */
	public static String GetAppReturnMsg(int code, String msg) {
		JSONObject jsonObject = new JSONObject();		
		jsonObject.accumulate("resultCode", code);
		jsonObject.accumulate("resultMsg", msg.toString());
		return jsonObject.toString();
	}
	
	/**
	 * app服务端组装返回json
	 * @param code 返回值的编码
	 * @param key 错误消息key
	 * @return JSON格式的 字符串
	 */
	public static String GetAppR18nMsg(HttpServletRequest request,String key) {
		String msg = "";
		if (!key.isEmpty()) {
			RequestContext requestContext = new RequestContext(request);
			try {
				msg = requestContext.getMessage(key);
			} catch (Exception e) {

			}
		}
		return msg;
	}

	/**
	 * 根据当前语言获取错误消息
	 *
	 * @param key
	 * @param args
	 * @return msg
	 */
	public static String GetAppR18nMsg(HttpServletRequest request,String key, Object... args) {
		RequestContext requestContext = new RequestContext(request);
		String msg = "";
		try {
			msg = String.format(requestContext.getMessage(key), args);
		} catch (Exception e) {

		}
		return msg;
	}

	/**
	 * 获取语言包简称
	 *
	 * @return en,cn,tw
	 */
	public static String getLan(HttpServletRequest request) {
		return RequestContextUtils.getLocaleResolver(request).resolveLocale(request).toString();
	}

	/**
	 * 设置语言
	 * @param request
	 * @param response
	 * @param lan 语言(cn,tw,en)
	 */
	public static boolean setLan(HttpServletRequest request, HttpServletResponse response, String lan) {
		try {
			LocaleResolver localeResolver = RequestContextUtils.getLocaleResolver(request);
			localeResolver.setLocale(request, response, StringUtils.parseLocaleString(lan));
			return true;
		} catch (Exception e) {
			e.printStackTrace();
		}
		return false;
	}

}
