package com.qkwl.common.dto.Enum;

/**
 * api错误消息枚举
 * @author ZKF
 */
public enum ApiErrorCodeMsgEnum {
	
	E10001(10001,"服务器繁忙"),
	E10002(10002,"没有足够的人民币"),
	E10005(10005,"账户锁定"),
	E10006(10006,"无法操作爆仓的系统单"),
	E10007(10007,"资产异常, 请联系客服"),
	E10008(10008,"用户不存在"),
	E10010(10010,"没有足够的比特币"),
	E10011(10011,"没有足够的莱特币"),
	E10026(10026,"该委托不存在"),
	E10034(10034,"资产被锁定,无法交易"),
	E10037(10037,"该委托已在队列中，不能取消或修改"),
	E10038(10038,"取消委托失败"),
	E10039(10039,"市价单不能修改"),
	E10040(10040,"市价单不能取消"),
	E10041(10041,"该委托已经结束, 不能取消或修改"),
	E10042(10042,"该委托已经取消, 不能取消或修改"),
	E10043(10043,"该委托已经全部成交，不能取消或修改"),
	E10048(10048,"买入金额不能小于1元"),
	E10050(10050,"莱特币买入价格不能高于现价的110%"),
	E10052(10052,"比特币交易数量不能小于0.001"),
	E10053(10053,"莱特币交易数量不能小于0.01"),
	E10054(10054,"莱特币卖出价格不能低于现价的90%"),
	E10055(10055,"比特币买入价格不能高于现价的110%"),
	E10056(10056,"比特币卖出价格不能低于现价的90%"),
	E10058(10058,"买入价格不能高于现价的105%"),
	E10059(10059,"卖出价格不能低于现价的95%"),
	E10061(10061,"请求缺少必要参数"),
	E10062(10062,"您的IP地址:{XXX.XXX.XXX.XXX}是不受信任的"),
	E10063(10063,"请求参数不正确"),
	E10064(10064,"无效的请求"),
	E10065(10065,"无效的方法"),
	E10067(10067,"私钥验证失败"),
	E10068(10068,"无效的价格"),
	E10069(10069,"无效的数量"),
	E10070(10070,"无效的请求时间"),
	E10071(10071,"请求次数过多"),
	E10072(10072,"无效的订单类型"),
	E10073(10073,"无效的交易类型"),
	E10074(10074,"请求信息不支持"),
	E10076(10076,"无效的资产类型"),
	E10077(10077,"账户类型与币种不符"),
	E10078(10078,"无效的交易市场"),
	E10087(10087,"交易数量小于 0.1 BTC，买入价格请不要高于市价 1%"),
	E10088(10088,"交易数量小于 0.1 BTC，卖出价格请不要低于市价 1%"),
	E10089(10089,"交易数量小于 0.1 LTC，买入价格请不要高于市价 1%"),
	E10090(10090,"交易数量小于 0.1 LTC，卖出价格请不要低于市价 1%"),
	E10091(10091,"无效的币种"),
	E10094(10094,"资金密码输错{0}次，连续错误5次将冻结24小时，请重试"),
	E10095(10095,"资金密码错误超过5次，已被冻结24小时"),
	E10097(10097,"请输入资金密码"),
	E10107(10107,"用户自定义订单号已存在"),
	E10110(10110,"限价单交易价格不能超过2位小数"),
	E10111(10111,"限价单交易数量不能超过4位小数"),
	E10112(10112,"市价单买入金额不能超过2位小数"),
	E10113(10113,"市价单卖出数量不能超过4位小数"),
	E10114(10114,"交易价格不能多于10万元"),
	E10118(10118,"下单失败"),
	E10119(10119,"比特币交易不能超过1000个"),
	E10120(10120,"市价单买入金额不能超过10万美元"),
	E10122(10122,"限价单比特币交易价格不能低于0.01"),
	E10123(10123,"限价单莱特币交易价格不能低于0.01"),
	E10124(10124,"买入金额不能超过100万人民币"),
	E10140(10140,"提取比特币数量不能超过4位小数"),
	E10201(10201,"最少转移0.0001"),
	E10202(10202,"转账数量不能超过4位小数"),
	E10203(10203,"ip错误"),
	E10204(10204,"无效的用户"),
	E10205(10205,"转出账户错误"),
	E10206(10206,"转入账户错误"),
	E10207(10207,"转账金额有误"),
	E10208(10208,"转账出错"),
	E10209(10209,"人民币现货资产错误"),
	E10210(10210,"美元现货资产错误"),
	E10211(10211,"可用资产不足"),
	E10212(10212,"转入账户和转出账户不能为同一个账户"),
	E10213(10213,"系统暂时不支持莱特币转账"),
	E10214(10214,"机构账户不允许转账"),
	E10220(10220,"莱特币交易不能超过20000个"),
	E10300(10300,"请使用POST提交请求"),
	E10301(10301,"上次修改资金密码时间为:{yyyy-MM-dd hh:mm:ss},为了您的资金安全,修改资金密码24小时以内不允许提现、提币。"),
	E10302(10302,"禁止提现"),
	E10303(10303,"没有权限"),
	E10304(10304,"用户锁定"),
	E10305(10305,"资产异常，请联系客服"),
	E10306(10306,"提现地址不存在"),
	E10307(10307,"非安全认证提现地址"),
	E10308(10308,"余额不足"),
	E10309(10309,"单笔提现比特币超过1000个,莱特币超过10000个时，请先与客服人员或客户经理预约提现"),
	E10310(10310,"比特币最小提现额度为0.0100,莱特币最小提现额度为0.1"),
	E10311(10311,"低于提现手续费"),
	E10312(10312,"超过当日累计"),
	E10313(10313,"提币地址错误"),
	E10314(10314,"提币记录不存在"),
	E10315(10315,"用户信息不正确"),
	E10316(10316,"该笔提现不能被取消"),
	E10317(10317,"系统繁忙"),
	E10318(10318,"未达到提现的安全标准"),
	E10319(10319,"提币次数过多");
	
	
	private Integer code;
	private Object value;

	private ApiErrorCodeMsgEnum(Integer code, Object value) {
		this.code = code;
		this.value = value;
	}

	public Integer getCode() {
		return code;
	}

	public void setCode(Integer code) {
		this.code = code;
	}

	public Object getValue() {
		return value;
	}

	public void setValue(Object value) {
		this.value = value;
	}

}
